cases/periodicHill/steadyState_kOmegaDavidsonNN_2D/system/crestProbe
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      crestProbe;
}

type            sets;
libs            (sampling);
writeControl    timeStep;
writeInterval   1;
executeControl  timeStep;
executeInterval 1;
interpolationScheme cellPoint;
setFormat       raw;
fields          (k omega sigmakNN CkNN Comega2NN nut);

sets
{
    x0015 { type uniform; axis y; nPoints 100; start (0.015  0 0.063); end (0.015  0.05 0.063); }
    x0017 { type uniform; axis y; nPoints 100; start (0.017  0 0.063); end (0.017  0.05 0.063); }
    x0018 { type uniform; axis y; nPoints 100; start (0.0185 0 0.063); end (0.0185 0.05 0.063); }
    x0019 { type uniform; axis y; nPoints 100; start (0.019  0 0.063); end (0.019  0.05 0.063); }
    x0020 { type uniform; axis y; nPoints 100; start (0.020  0 0.063); end (0.020  0.05 0.063); }
    x0022 { type uniform; axis y; nPoints 100; start (0.022  0 0.063); end (0.022  0.05 0.063); }
    x0025 { type uniform; axis y; nPoints 100; start (0.025  0 0.063); end (0.025  0.05 0.063); }
}
